Tekla Open API Reference for Tekla Structures 2025
BoltItem.BoltItemTypeEnum Enumeration
 Defines the different bolt item types.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltItemTypeEnum
Public Enumeration BoltItemTypeEnum
Members
Member name | Value | Description
BOLT_UNKNOWN | 0 |  The unknown bolt item type.
BOLT | 1 |  The bolt type.
STUD | 2 |  The stud type.
See Also
Reference
Tekla.Structures.Catalogs Namespace